packages/fxa-auth-server/test/local/payments/fixtures/paypal/do_reference_transaction_success.json

{
  "ACK": "Success",
  "AMT": "1555555.99",
  "AVSCODE": "",
  "CVV2MATCH": "",
  "BILLINGAGREEMENTID": "B-00R675662S291773P",
  "BUILD": "55100925",
  "CORRELATIONID": "a600174ee8945",
  "CURRENCYCODE": "USD",
  "FEEAMT": "45111.42",
  "ORDERTIME": "2021-01-25T17:02:15Z",
  "PARENTTRANSACTIONID": "PAYID-MAHPTFI9KG0531222783101E",
  "PAYMENTSTATUS": "Completed",
  "PAYMENTTYPE": "instant",
  "PENDINGREASON": "None",
  "PROTECTIONELIGIBILITY": "Eligible",
  "PROTECTIONELIGIBILITYTYPE": "ItemNotReceivedEligible,UnauthorizedPaymentEligible",
  "REASONCODE": "None",
  "TAXAMT": "0.00",
  "TIMESTAMP": "2021-01-25T17:02:17Z",
  "TRANSACTIONID": "51E835834L664664K",
  "TRANSACTIONTYPE": "merchtpmt",
  "VERSION": "204"
}
